app/controllers/appointment_kinds_controller.rb

SELECT * FROM "appointment_kinds"
---
  def index
    @appointment_kinds = AppointmentKind.all

SELECT * FROM "appointment_kinds" WHERE ("appointment_kinds"."id" = 1)
---
  def show
    @appointment_kind = AppointmentKind.find(params[:id])

SELECT * FROM "appointment_kinds" WHERE ("appointment_kinds"."id" = 1)
---
  def edit
    @appointment_kind = AppointmentKind.find(params[:id])

INSERT INTO "appointment_kinds" ("name", "duration", "created_at", "updated_at", "doctor_id", "description") VALUES('fkdmsml', 123, '2010-08-23 20:55:40', '2010-08-23 20:55:40', NULL, 'kvdùsvmùslv
---
  def create
    @appointment_kind = AppointmentKind.new(params[:appointment_kind])

    respond_to do |format|
      if @appointment_kind.save

SELECT * FROM "appointment_kinds" WHERE ("appointment_kinds"."id" = 1)
UPDATE "appointment_kinds" SET "updated_at" = '2010-08-23 19:24:43', "duration" = 14 WHERE "id" = 1
---
  def update
    @appointment_kind = AppointmentKind.find(params[:id])

    respond_to do |format|
      if @appointment_kind.update_attributes(params[:appointment_kind])