app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT * FROM "doctors"

  def show
    @doctor = Doctor.find(params[:id])
---
SELECT * FROM "doctors" WHERE ("doctors"."id" = 1)

  def edit
    @doctor = Doctor.find(params[:id])
	@appointment_kinds_list = AppointmentKind.all
---
SELECT * FROM "doctors" WHERE ("doctors"."id" = 1)
SELECT * FROM "appointment_kinds"

  def create
    @doctor = Doctor.new(params[:doctor])

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("created_at", "updated_at", "last_name", "first_name") VALUES('2010-08-23 20:14:54', '2010-08-23 20:14:54', 'jvdkldjkl', 'fdjsklgfsdk')

  def update
    @doctor = Doctor.find(params[:id])
---
SELECT * FROM "doctors" WHERE ("doctors"."id" = 1)